rzeldent/esp32-smartdisplay/src/smartdisplay_ili9341.cpp
#include <esp32_smartdisplay.h>

#ifdef USES_ILI9341

#include <driver/spi_master.h>
#include <esp_lcd_panel_io.h>
#include <esp_lcd_panel_vendor.h>
#include <esp_lcd_panel_ops.h>

#include "esp_lcd_ili9341.h"

esp_lcd_panel_io_handle_t io_handle;
esp_lcd_panel_handle_t panel_handle;

bool ili9341_color_trans_done(esp_lcd_panel_io_handle_t panel_io, esp_lcd_panel_io_event_data_t *edata, void *user_ctx)
{
    const auto disp_driver = (lv_disp_drv_t *)user_ctx;
    lv_disp_flush_ready(disp_driver);
    return false;
}

void ili9341_lv_flush(lv_disp_drv_t *drv, const lv_area_t *area, lv_color_t *color_map)
{
    const auto panel_handle = (esp_lcd_panel_handle_t)drv->user_data;
    // This is really a pity. Only SPI MSB first is suported. So far unable to find a better solution.
    // Ideal would to set display in LSB first
    auto size = lv_area_get_width(area) * lv_area_get_height(area);
    auto p = color_map;
    while (size--)
        p++->full = __bswap16(p->full);

    ESP_ERROR_CHECK(esp_lcd_panel_draw_bitmap(panel_handle, area->x1, area->y1, area->x2 + 1, area->y2 + 1, color_map));
};

void lvgl_tft_init(lv_disp_drv_t *drv)
{
    // Create SPI bus
    ESP_ERROR_CHECK(spi_bus_initialize(ILI9341_SPI_HOST, &ili9341_bus_config, SPI_DMA_CH_AUTO));

    // Attach the LCD controller to the SPI bus
    esp_lcd_panel_io_spi_config_t io_config = ili9341_io_spi_config;
    io_config.on_color_trans_done = ili9341_color_trans_done;
    io_config.user_ctx = drv;
    ESP_ERROR_CHECK(esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)ILI9341_SPI_HOST, &io_config, &io_handle));
    // Create ili9341 panel handle
    ESP_ERROR_CHECK(esp_lcd_new_panel_ili9341(io_handle, &ili9341_panel_dev_config, &panel_handle));
    ESP_ERROR_CHECK(esp_lcd_panel_reset(panel_handle));
    ESP_ERROR_CHECK(esp_lcd_panel_init(panel_handle));
    drv->user_data = panel_handle;
    drv->flush_cb = ili9341_lv_flush;
    // Turn display on
    ESP_ERROR_CHECK(esp_lcd_panel_disp_on_off(panel_handle, true));
}

#endif